Перевірка на пароль
const пароль = prompt('Введіть пароль');
if (пароль == 787898) {
    console.log('Пароль вірний');
} else {
    console.log('Хибний пароль');
}


Кількість столів
let число = prompt('Введіть число');
const x = 1;
x + 1;
x && 1;
const y = 2;
3;
4;
y + 2;
y + 3;
число + 4;

if (число == x) {
    console.log(x + 'стіл');
} else if (число == y) {
    console.log(y + 'столи');
}
if (число !== x && число !== y) {
    console.log(число + 'столів')
}





Повідомлення відносно ролі
let name = prompt('Як вас звати?');
if (name == 'Ігор')
    alert('Привіт, адмін ' + name);

if (name == 'Сергій') {
    alert('Привіт, адмін ' + name);
}
if (name == 'Паша') {
    alert('Привіт, хворий ' + name);
}
if (name == 'Оля') {
    alert('Вітання Вам, ' + name);
} else if (name !== 'Ігор' && name !== 'Сергій' && name !== 'Паша' && name !== 'Оля') {
    console.log('Постороннім вхід заборонено, коронавірус');
}